app/views/bikeadvs/show.html.erb

                    <li class="list-group-item" style="color: aliceblue; background-color: rgb(25, 25, 25);">City: <%= @bikeadv.city %></li>
                    <li class="list-group-item" style="color: aliceblue; background-color: rgb(25, 25, 25);">Owner's name: <%= @bikeadv.user.firstname %></li>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]