app/controllers/bikesellingadvs_controller.rb

    def create
        authorize! :create, Bikesellingadv, :message => "You are not authorized"
        @bikesellingadv = current_user.bikesellingadvs.new(bikesellingadv_params)
        if @bikesellingadv.check
            @bikesellingadv.save
---
INSERT INTO "bikesellingadvs" ("city", "start_date", "end_date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["city", "Napoli"], ["start_date", "2022-05-16"], ["end_date", "2022-05-19"], ["user_id", 1], ["created_at", "2022-01-31 16:52:49.939210"], ["updated_at", "2022-01-31 16:52:49.939210"]]

    def index
        authorize! :index, Bikesellingadv, :message => "You are not authorized"
        @bikesellingadvs = User.find(params[:user_id]).bikesellingadvs
---
SELECT "bikesellingadvs".* FROM "bikesellingadvs" WHERE "bikesellingadvs"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]