app/controllers/bikeadvs_controller.rb

    def create
      authorize! :create, Bikeadv, :message => "You are not authorized"
      @bikeadv = current_user.bikeadvs.create(bikeadv_params)
---
INSERT INTO "bikeadvs" ("scuderia", "modello", "cilindrata", "anno", "city", "description", "advices", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def index
      authorize! :index, Bikeadv, :message => "You are not authorized"
      @bikeadvs = User.find(params[:user_id]).bikeadvs
---
SELECT "bikeadvs".* FROM "bikeadvs" WHERE "bikeadvs"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def edit
      authorize! :edit, Bikeadv, :message => "You are not authorized"
      @bikeadv = User.find(params[:user_id]).bikeadvs.find(params[:id])
---
SELECT "bikeadvs".* FROM "bikeadvs" WHERE "bikeadvs"."user_id" = ? AND "bikeadvs"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
      authorize! :update, Bikeadv, :message => "You are not authorized"
      @bikeadv = User.find(params[:user_id]).bikeadvs.find(params[:id])
      if @bikeadv.update(bikeadv_params)
---
SELECT "bikeadvs".* FROM "bikeadvs" WHERE "bikeadvs"."user_id" = ? AND "bikeadvs"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "bikeadvs" SET "city" = ?, "updated_at" = ? WHERE "bikeadvs"."id" = ?  [["city", "Rome"], ["updated_at", "2022-02-02 12:27:36.946768"], ["id", 1]]

    def show
      authorize! :show, Bikeadv, :message => "You are not authorized"
      @bikeadv = Bikeadv.find(params[:id])
---
SELECT "bikeadvs".* FROM "bikeadvs" WHERE "bikeadvs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def destroy
      authorize! :destroy, Bikeadv, :message => "You are not authorized"
      @bikeadv = User.find(params[:user_id]).bikeadvs.find(params[:id])
      @bikeadv.destroy
---
SELECT "bikeadvs".* FROM "bikeadvs" WHERE "bikeadvs"."user_id" = ? AND "bikeadvs"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bikeadvs" WHERE "bikeadvs"."id" = ?  [["id", 1]]