app/controllers/users_controller.rb

UPDATE "users" SET "firstname" = ?, "lastname" = ?, "dateofbirth" = ?, "gender" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["firstname", "Elisabeth"], ["lastname", "Getachew"], ["dateofbirth", "1998-03-16 00:00:00"], ["gender", "F"], ["updated_at", "2022-01-31 15:42:41.642230"], ["id", 5]]
---
    def update
        @user = current_user
        @user.set_basic
        if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
---
    def destroy
        current_user.destroy

SELECT "users".* FROM "users"
---
    def index
        authorize! :index, User, :message => "You are not authorized"
        @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def ban
        authorize! :ban, User, :message => "You are not authorized"
        user = User.find(params[:id])