app/models/user.rb

    def set_basic
      self.roles_mask = (self.roles_mask | 1)
      self.save
---
UPDATE "users" SET "updated_at" = ?, "roles_mask" = ? WHERE "users"."id" = ?  [["updated_at", "2022-01-31 15:42:41.426728"], ["roles_mask", 1], ["id", 5]]