app/views/bikesellingadvs/findadv.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                <td><%= bikesellingadv.city %></td>
                <td><%= bikesellingadv.user.firstname %></td>